cf_billing/DataProcessors/бестФорма46.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестФорма46</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтавкиНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДССсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДСВнутри</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестОбъемНачисленийЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестОбъемНачисленийЭлектроэнергии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСредневзвешенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавкуПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаУслугиПоПередачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаИныеУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСредневзвешеннаяНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавкуНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавкуНДСПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаУслугиПоПередачиНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаИныеУслугиНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньНапряженияРасчетный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифНаИныеУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифЗаСбытовуюНадбавку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифЗаСбытовуюНадбавкуПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифЗаУслугиПоПередачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифСредневзвешенный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВДолевойСхеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутриИныеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутриСбытоваяНадбавка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутриУслугиПоПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчаствуетВРаспределенииМКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТарифаНезависимыйСбыт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыЦенНаЭЭ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/энргУровниНапряжения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргУровниНапряжения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/бестФорма46/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеРазделов(ПараметрыОтборов, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(, "Чтение данных");
	
	НастройкиРазделов = НастройкиРазделов();
	НастройкиРаздела1В = НастройкиРаздела1В();
	
	РезультатЗапросаПакет = РезультатЗапросаНачисления(ПараметрыОтборов);
	КолвоПакетов = РезультатЗапросаПакет.Количество();
	
	ДлительныеОперации.СообщитьПрогресс(, "Формирование раздела 1. А");
	РезультатЗапроса = РезультатЗапросаПакет[КолвоПакетов - 3];
	Раздел1А = СфомироватьТаблицуРаздела1А(НастройкиРазделов, РезультатЗапроса);
	
	ДлительныеОперации.СообщитьПрогресс(, "Формирование раздела 1. Б");
	РезультатЗапроса = РезультатЗапросаПакет[КолвоПакетов - 2];
	Раздел1Б = СфомироватьТаблицуРаздела1Б(НастройкиРазделов, РезультатЗапроса);
	
	ДлительныеОперации.СообщитьПрогресс(, "Формирование раздела 1. В");
	РезультатЗапроса = РезультатЗапросаПакет[КолвоПакетов - 1];
	Раздел1В = СфомироватьТаблицуРаздела1В(НастройкиРаздела1В, РезультатЗапроса);
	 
	Результат = Новый Структура("Раздел1А,Раздел1Б,Раздел1В", Раздел1А, Раздел1Б, Раздел1В);
	Возврат Результат;
	
КонецФункции

Функция НовыеПараметрыОтборов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НачалоОП", Дата(1,1,1));
	Результат.Вставить("КонецОП", Дата(1,1,1));
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатЗапросаНачисления(ПараметрыОтборов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСтавкиНДССрезПоследних.Организация КАК Организация,
		|	бестСтавкиНДССрезПоследних.СтавкаНДС КАК СтавкаНДС
		|ПОМЕСТИТЬ ТаблицаСтавкаНДС
		|ИЗ
		|	РегистрСведений.бестСтавкиНДС.СрезПоследних(&КонецОП, Организация = &Организация) КАК бестСтавкиНДССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестОбъемНачисленийЭлектроэнергии.Период КАК Период,
		|	энргДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.бестВидыДоговоров.ДоговорКуплиПродажи) КАК ДоговорКуплиПродажи,
		|	бестОбъемНачисленийЭлектроэнергии.ЦеноваяКатегория КАК ЦеноваяКатегория,
		|	бестОбъемНачисленийЭлектроэнергии.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	бестОбъемНачисленийЭлектроэнергии.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	энргДоговорыКонтрагентов.КатегорияПотребителя КАК КатегорияПотребителя,
		|	энргВидыУслуг.бестИспользоватьРасчетПоМощности КАК ЭтоМощность,
		|	СУММА(бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(ВЫБОР
		|			КОГДА бестОбъемНачисленийЭлектроэнергии.НДСВнутри
		|				ТОГДА бестОбъемНачисленийЭлектроэнергии.Сумма - бестОбъемНачисленийЭлектроэнергии.СуммаНДС
		|			ИНАЧЕ бестОбъемНачисленийЭлектроэнергии.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА бестОбъемНачисленийЭлектроэнергии.НДСВнутри
		|			ТОГДА бестОбъемНачисленийЭлектроэнергии.Сумма
		|		ИНАЧЕ бестОбъемНачисленийЭлектроэнергии.Сумма + бестОбъемНачисленийЭлектроэнергии.СуммаНДС
		|	КОНЕЦ КАК СуммаСНДС,
		|	бестОбъемНачисленийЭлектроэнергии.Организация КАК Организация,
		|	бестОбъемНачисленийЭлектроэнергии.Район КАК Район,
		|	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета КАК ОбъектРасчета,
		|	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета КАК ТочкаУчета,
		|	бестОбъемНачисленийЭлектроэнергии.ПриборУчета КАК ПриборУчета,
		|	бестОбъемНачисленийЭлектроэнергии.Шкала КАК Шкала,
		|	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона КАК ТарифнаяЗона,
		|	бестОбъемНачисленийЭлектроэнергии.СпособНачисления КАК СпособНачисления
		|ПОМЕСТИТЬ НачисленияЮридическиеЛица
		|ИЗ
		|	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО бестОбъемНачисленийЭлектроэнергии.Услуга = энргВидыУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
		|		ПО бестОбъемНачисленийЭлектроэнергии.Договор = энргДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	бестОбъемНачисленийЭлектроэнергии.Период МЕЖДУ &НачалоОП И &КонецОП
		|	И бестОбъемНачисленийЭлектроэнергии.Организация = &Организация
		|	И бестОбъемНачисленийЭлектроэнергии.Район = &Район
		|	И бестОбъемНачисленийЭлектроэнергии.Распределение = ЛОЖЬ
		|	И НЕ бестОбъемНачисленийЭлектроэнергии.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.Реактив)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестОбъемНачисленийЭлектроэнергии.УровеньНапряженияРасчетный,
		|	энргДоговорыКонтрагентов.КатегорияПотребителя,
		|	бестОбъемНачисленийЭлектроэнергии.ЦеноваяКатегория,
		|	энргВидыУслуг.бестИспользоватьРасчетПоМощности,
		|	бестОбъемНачисленийЭлектроэнергии.МаксимальнаяМощность,
		|	бестОбъемНачисленийЭлектроэнергии.Организация,
		|	бестОбъемНачисленийЭлектроэнергии.Район,
		|	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
		|	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета,
		|	бестОбъемНачисленийЭлектроэнергии.ПриборУчета,
		|	бестОбъемНачисленийЭлектроэнергии.Шкала,
		|	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона,
		|	бестОбъемНачисленийЭлектроэнергии.Период,
		|	бестОбъемНачисленийЭлектроэнергии.СпособНачисления,
		|	ВЫБОР
		|		КОГДА бестОбъемНачисленийЭлектроэнергии.НДСВнутри
		|			ТОГДА бестОбъемНачисленийЭлектроэнергии.Сумма
		|		ИНАЧЕ бестОбъемНачисленийЭлектроэнергии.Сумма + бестОбъемНачисленийЭлектроэнергии.СуммаНДС
		|	КОНЕЦ,
		|	энргДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.бестВидыДоговоров.ДоговорКуплиПродажи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Район КАК Район,
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
		|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
		|ПОМЕСТИТЬ ВидыДифференцированности
		|ИЗ
		|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
		|			&КонецОП,
		|			Организация = &Организация
		|				И Район = &Район
		|				И (ОбъектРасчета, ТочкаУчета, ПриборУчета, Шкала) В
		|					(ВЫБРАТЬ
		|						НачисленияЮридическиеЛица.ОбъектРасчета КАК ОбъектРасчета,
		|						НачисленияЮридическиеЛица.ТочкаУчета КАК ТочкаУчета,
		|						НачисленияЮридическиеЛица.ПриборУчета КАК ПриборУчета,
		|						НачисленияЮридическиеЛица.Шкала КАК Шкала
		|					ИЗ
		|						НачисленияЮридическиеЛица КАК НачисленияЮридическиеЛица)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияЮридическиеЛица.ДоговорКуплиПродажи КАК ДоговорКуплиПродажи,
		|	НачисленияЮридическиеЛица.ЦеноваяКатегория КАК ЦеноваяКатегория,
		|	НачисленияЮридическиеЛица.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	НачисленияЮридическиеЛица.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	НачисленияЮридическиеЛица.КатегорияПотребителя КАК КатегорияПотребителя,
		|	НачисленияЮридическиеЛица.ЭтоМощность КАК ЭтоМощность,
		|	НачисленияЮридическиеЛица.ОбъемУслуги КАК ОбъемУслуги,
		|	НачисленияЮридическиеЛица.Сумма КАК Сумма,
		|	НачисленияЮридическиеЛица.СуммаСНДС КАК СуммаСНДС,
		|	НачисленияЮридическиеЛица.Организация КАК Организация,
		|	НачисленияЮридическиеЛица.Район КАК Район,
		|	НачисленияЮридическиеЛица.ОбъектРасчета КАК ОбъектРасчета,
		|	НачисленияЮридическиеЛица.ТочкаУчета КАК ТочкаУчета,
		|	НачисленияЮридическиеЛица.ПриборУчета КАК ПриборУчета,
		|	НачисленияЮридическиеЛица.Шкала КАК Шкала,
		|	НачисленияЮридическиеЛица.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ВидыДифференцированности.ВидДифференцированности КАК ВидДифференцированности
		|ПОМЕСТИТЬ НачисленияЮридическиеЛицаРазделВ
		|ИЗ
		|	НачисленияЮридическиеЛица КАК НачисленияЮридическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыДифференцированности КАК ВидыДифференцированности
		|		ПО НачисленияЮридическиеЛица.Организация = ВидыДифференцированности.Организация
		|			И НачисленияЮридическиеЛица.Район = ВидыДифференцированности.Район
		|			И НачисленияЮридическиеЛица.ОбъектРасчета = ВидыДифференцированности.ОбъектРасчета
		|			И НачисленияЮридическиеЛица.ТочкаУчета = ВидыДифференцированности.ТочкаУчета
		|			И НачисленияЮридическиеЛица.ПриборУчета = ВидыДифференцированности.ПриборУчета
		|			И НачисленияЮридическиеЛица.Шкала = ВидыДифференцированности.Шкала
		|			И (НЕ НачисленияЮридическиеЛица.ЭтоМощность)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.Организация КАК Организация,
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.Район КАК Район,
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки КАК ТочкаПоставки
		|ПОМЕСТИТЬ ВТ_ТочкиПоставки
		|ИЗ
		|	РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
		|			,
		|			(Организация, Район, ОбъектРасчета, ТочкаУчета) В
		|				(ВЫБРАТЬ
		|					НачисленияЮридическиеЛица.Организация КАК Организация,
		|					НачисленияЮридическиеЛица.Район КАК Район,
		|					НачисленияЮридическиеЛица.ОбъектРасчета КАК ОбъектРасчета,
		|					НачисленияЮридическиеЛица.ТочкаУчета КАК ТочкаУчета
		|				ИЗ
		|					НачисленияЮридическиеЛица КАК НачисленияЮридическиеЛица)) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргПараметрыТочекПоставки.МоментВремени КАК МоментВремени,
		|	энргПараметрыТочекПоставки.Период КАК Период,
		|	энргПараметрыТочекПоставки.Регистратор КАК Регистратор,
		|	ВТ_ТочкиПоставки.Организация КАК Организация,
		|	ВТ_ТочкиПоставки.Район КАК Район,
		|	ВТ_ТочкиПоставки.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТочкиПоставки.ТочкаУчета КАК ТочкаУчета,
		|	энргПараметрыТочекПоставки.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	энргПараметрыТочекПоставки.МаксимальнаяМощность КАК МаксимальнаяМощность
		|ПОМЕСТИТЬ ВТ_УровниНапряженияТУ
		|ИЗ
		|	ВТ_ТочкиПоставки КАК ВТ_ТочкиПоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки КАК энргПараметрыТочекПоставки
		|		ПО ВТ_ТочкиПоставки.ТочкаПоставки = энргПараметрыТочекПоставки.ТочкаПоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УровниНапряженияТУ.Период КАК НачалоПериода,
		|	ВТ_УровниНапряженияТУ.Регистратор КАК Регистратор,
		|	ВТ_УровниНапряженияТУ.Организация КАК Организация,
		|	ВТ_УровниНапряженияТУ.Район КАК Район,
		|	ВТ_УровниНапряженияТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_УровниНапряженияТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_УровниНапряженияТУ.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	ВТ_УровниНапряженияТУ.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	МИНИМУМ(ЕСТЬNULL(ВТ_УровниНапряженияТУ1.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК МинПериод
		|ПОМЕСТИТЬ ВТ_МинПериод
		|ИЗ
		|	ВТ_УровниНапряженияТУ КАК ВТ_УровниНапряженияТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УровниНапряженияТУ КАК ВТ_УровниНапряженияТУ1
		|		ПО ВТ_УровниНапряженияТУ.Организация = ВТ_УровниНапряженияТУ1.Организация
		|			И ВТ_УровниНапряженияТУ.Район = ВТ_УровниНапряженияТУ1.Район
		|			И ВТ_УровниНапряженияТУ.ОбъектРасчета = ВТ_УровниНапряженияТУ1.ОбъектРасчета
		|			И ВТ_УровниНапряженияТУ.ТочкаУчета = ВТ_УровниНапряженияТУ1.ТочкаУчета
		|			И ВТ_УровниНапряженияТУ.МоментВремени < ВТ_УровниНапряженияТУ1.МоментВремени
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_УровниНапряженияТУ.УровеньНапряженияРасчетный,
		|	ВТ_УровниНапряженияТУ.Период,
		|	ВТ_УровниНапряженияТУ.Регистратор,
		|	ВТ_УровниНапряженияТУ.Район,
		|	ВТ_УровниНапряженияТУ.Организация,
		|	ВТ_УровниНапряженияТУ.ОбъектРасчета,
		|	ВТ_УровниНапряженияТУ.ТочкаУчета,
		|	ВТ_УровниНапряженияТУ.МаксимальнаяМощность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МинПериод.НачалоПериода КАК НачалоПериода,
		|	ВТ_МинПериод.Регистратор КАК Регистратор,
		|	ВТ_МинПериод.Организация КАК Организация,
		|	ВТ_МинПериод.Район КАК Район,
		|	ВТ_МинПериод.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_МинПериод.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_МинПериод.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	ВТ_МинПериод.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	МИНИМУМ(ВТ_УровниНапряженияТУ.Регистратор) КАК МинРегистратор
		|ПОМЕСТИТЬ ВТ_МинРегистратор
		|ИЗ
		|	ВТ_МинПериод КАК ВТ_МинПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УровниНапряженияТУ КАК ВТ_УровниНапряженияТУ
		|		ПО ВТ_МинПериод.Организация = ВТ_УровниНапряженияТУ.Организация
		|			И ВТ_МинПериод.Район = ВТ_УровниНапряженияТУ.Район
		|			И ВТ_МинПериод.ОбъектРасчета = ВТ_УровниНапряженияТУ.ОбъектРасчета
		|			И ВТ_МинПериод.ТочкаУчета = ВТ_УровниНапряженияТУ.ТочкаУчета
		|			И ВТ_МинПериод.МинПериод = ВТ_УровниНапряженияТУ.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МинПериод.УровеньНапряженияРасчетный,
		|	ВТ_МинПериод.НачалоПериода,
		|	ВТ_МинПериод.Регистратор,
		|	ВТ_МинПериод.Организация,
		|	ВТ_МинПериод.ОбъектРасчета,
		|	ВТ_МинПериод.Район,
		|	ВТ_МинПериод.ТочкаУчета,
		|	ВТ_МинПериод.МаксимальнаяМощность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МинРегистратор.Организация КАК Организация,
		|	ВТ_МинРегистратор.Район КАК Район,
		|	ВТ_МинРегистратор.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_МинРегистратор.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_МинРегистратор.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	ВТ_МинРегистратор.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	ВТ_МинРегистратор.НачалоПериода КАК НачалоПериода,
		|	ЕСТЬNULL(ВТ_УровниНапряженияТУ.Период, &КонецОП) КАК КонецПериода
		|ПОМЕСТИТЬ ВТ_ПериодыУровнейНапряженияТУ
		|ИЗ
		|	ВТ_МинРегистратор КАК ВТ_МинРегистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УровниНапряженияТУ КАК ВТ_УровниНапряженияТУ
		|		ПО ВТ_МинРегистратор.Организация = ВТ_УровниНапряженияТУ.Организация
		|			И ВТ_МинРегистратор.Район = ВТ_УровниНапряженияТУ.Район
		|			И ВТ_МинРегистратор.ОбъектРасчета = ВТ_УровниНапряженияТУ.ОбъектРасчета
		|			И ВТ_МинРегистратор.ТочкаУчета = ВТ_УровниНапряженияТУ.ТочкаУчета
		|			И ВТ_МинРегистратор.МинРегистратор = ВТ_УровниНапряженияТУ.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргОбъемНачислений.Организация КАК Организация,
		|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
		|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
		|	ВЫБОР
		|		КОГДА энргОбъемНачислений.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
		|		ИНАЧЕ энргОбъемНачислений.ВидДифференцированности
		|	КОНЕЦ КАК ВидДифференцированности,
		|	ВЫБОР
		|		КОГДА энргОбъемНачислений.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
		|		ИНАЧЕ энргОбъемНачислений.ТарифнаяЗона
		|	КОНЕЦ КАК ТарифнаяЗона,
		|	СУММА(энргОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(энргОбъемНачислений.ОбъемУслугиСоцНорма) КАК ОбъемУслугиСоцНорма,
		|	СУММА(энргОбъемНачислений.Сумма) КАК Сумма
		|ПОМЕСТИТЬ НачисленияФизическиеЛица
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.Период МЕЖДУ &НачалоОП И &КонецОП
		|	И энргОбъемНачислений.Организация = &Организация
		|	И энргОбъемНачислений.Район = &Район
		|	И энргОбъемНачислений.Распределение = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.СверхНорматива,
		|	энргОбъемНачислений.ТарифнаяГруппа,
		|	ВЫБОР
		|		КОГДА энргОбъемНачислений.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
		|		ИНАЧЕ энргОбъемНачислений.ВидДифференцированности
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА энргОбъемНачислений.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
		|		ИНАЧЕ энргОбъемНачислений.ТарифнаяЗона
		|	КОНЕЦ,
		|	энргОбъемНачислений.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидыДифференцированностиТарифныеЗоны.Ссылка КАК ВидДифференцированности,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона) КАК КоличествоТЗ
		|ПОМЕСТИТЬ КоличествоТарифныхЗон
		|ИЗ
		|	Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВидыДифференцированностиТарифныеЗоны.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияЮридическиеЛица.КатегорияПотребителя КАК КатегорияПотребителя,
		|	НачисленияЮридическиеЛица.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
		|	НачисленияЮридическиеЛица.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл1Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл1Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл2Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл2Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл35Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл35Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемМощ35Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьМощ35Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл46Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл46Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемМощНаРР46Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьМощНаРР46Ц,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОбъемМощНаПередачу46Ц,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьМощНаПередачу46Ц
		|ИЗ
		|	НачисленияЮридическиеЛица КАК НачисленияЮридическиеЛица
		|ГДЕ
		|	НЕ НачисленияЮридическиеЛица.УровеньНапряженияРасчетный = ЗНАЧЕНИЕ(Перечисление.энргУровниНапряжения.ПустаяСсылка)
		|	И НЕ НачисленияЮридическиеЛица.ДоговорКуплиПродажи
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияЮридическиеЛица.КатегорияПотребителя,
		|	НачисленияЮридическиеЛица.УровеньНапряженияРасчетный,
		|	НачисленияЮридическиеЛица.МаксимальнаяМощность,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачисленияЮридическиеЛица.КатегорияПотребителя,
		|	ВТ_ПериодыУровнейНапряженияТУ.УровеньНапряженияРасчетный,
		|	ВТ_ПериодыУровнейНапряженияТУ.МаксимальнаяМощность,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	НачисленияЮридическиеЛица КАК НачисленияЮридическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыУровнейНапряженияТУ КАК ВТ_ПериодыУровнейНапряженияТУ
		|		ПО НачисленияЮридическиеЛица.Организация = ВТ_ПериодыУровнейНапряженияТУ.Организация
		|			И НачисленияЮридическиеЛица.Район = ВТ_ПериодыУровнейНапряженияТУ.Район
		|			И НачисленияЮридическиеЛица.ОбъектРасчета = ВТ_ПериодыУровнейНапряженияТУ.ОбъектРасчета
		|			И НачисленияЮридическиеЛица.ТочкаУчета = ВТ_ПериодыУровнейНапряженияТУ.ТочкаУчета
		|			И НачисленияЮридическиеЛица.Период >= ВТ_ПериодыУровнейНапряженияТУ.НачалоПериода
		|			И НачисленияЮридическиеЛица.Период <= ВТ_ПериодыУровнейНапряженияТУ.КонецПериода
		|ГДЕ
		|	НачисленияЮридическиеЛица.УровеньНапряженияРасчетный = ЗНАЧЕНИЕ(Перечисление.энргУровниНапряжения.ПустаяСсылка)
		|	И НЕ НачисленияЮридическиеЛица.ДоговорКуплиПродажи
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияЮридическиеЛица.КатегорияПотребителя,
		|	ВТ_ПериодыУровнейНапряженияТУ.УровеньНапряженияРасчетный,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|				И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
		|				И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
		|					ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|			ТОГДА НачисленияЮридическиеЛица.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВТ_ПериодыУровнейНапряженияТУ.МаксимальнаяМощность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияЮридическиеЛица.КатегорияПотребителя КАК КатегорияПотребителя,
		|	НачисленияЮридическиеЛица.МаксимальнаяМощность КАК МаксимальнаяМощность,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл1Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл1Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл2Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл2Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл34Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл34Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемМощ34Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьМощ34Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемЭл56Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ НачисленияЮридическиеЛица.ЭтоМощность
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЭл56Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемМощ56Ц,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияЮридическиеЛица.ЭтоМощность
		|					И НачисленияЮридическиеЛица.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
		|					И (НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
		|						ИЛИ НачисленияЮридическиеЛица.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
		|				ТОГДА НачисленияЮридическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьМощ56Ц
		|ИЗ
		|	НачисленияЮридическиеЛица КАК НачисленияЮридическиеЛица
		|ГДЕ
		|	НачисленияЮридическиеЛица.ДоговорКуплиПродажи
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияЮридическиеЛица.КатегорияПотребителя,
		|	НачисленияЮридическиеЛица.МаксимальнаяМощность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияФизическиеЛица.ТарифнаяГруппа КАК ТарифнаяКатегория,
		|	НачисленияФизическиеЛица.СверхНорматива КАК СверхНорматива,
		|	NULL КАК КатегорияПотребителя,
		|	NULL КАК ЦеноваяКатегория,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 1
		|				ТОГДА НачисленияФизическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемОднотарифный,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 1
		|				ТОГДА НачисленияФизическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОднотарифный,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 1
		|				ТОГДА НачисленияФизическиеЛица.Сумма - (ВЫРАЗИТЬ(НачисленияФизическиеЛица.Сумма * ТаблицаСтавкаНДС.СтавкаНДС / 100 КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСОднотарифный,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ДЕНЬ)
		|				ТОГДА НачисленияФизическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемДвухтарифныйДень,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияФизическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемДвухтарифныйНочь,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ДЕНЬ)
		|				ТОГДА НачисленияФизическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДвухтарифныйДень,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ДЕНЬ)
		|				ТОГДА НачисленияФизическиеЛица.Сумма - (ВЫРАЗИТЬ(НачисленияФизическиеЛица.Сумма * ТаблицаСтавкаНДС.СтавкаНДС / 100 КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСДвухтарифныйДень,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияФизическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДвухтарифныйНочь,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияФизическиеЛица.Сумма - (ВЫРАЗИТЬ(НачисленияФизическиеЛица.Сумма * ТаблицаСтавкаНДС.СтавкаНДС / 100 КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСДвухтарифныйНочь,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияФизическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемТрехтарифныйНочь,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПИК)
		|				ТОГДА НачисленияФизическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемТрехтарифныйПик,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПОЛУПИК)
		|				ТОГДА НачисленияФизическиеЛица.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемТрехтарифныйПолупик,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияФизическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаТрехтарифныйНочь,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияФизическиеЛица.Сумма - (ВЫРАЗИТЬ(НачисленияФизическиеЛица.Сумма * ТаблицаСтавкаНДС.СтавкаНДС / 100 КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСТрехтарифныйНочь,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПИК)
		|				ТОГДА НачисленияФизическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаТрехтарифныйПик,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПИК)
		|				ТОГДА НачисленияФизическиеЛица.Сумма - (ВЫРАЗИТЬ(НачисленияФизическиеЛица.Сумма * ТаблицаСтавкаНДС.СтавкаНДС / 100 КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСТрехтарифныйПик,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПОЛУПИК)
		|				ТОГДА НачисленияФизическиеЛица.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаТрехтарифныйПолуПик,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияФизическиеЛица.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПОЛУПИК)
		|				ТОГДА НачисленияФизическиеЛица.Сумма - (ВЫРАЗИТЬ(НачисленияФизическиеЛица.Сумма * ТаблицаСтавкаНДС.СтавкаНДС / 100 КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСТрехтарифныйПолуПик,
		|	""ФЛ"" КАК ВидЛица
		|ИЗ
		|	НачисленияФизическиеЛица КАК НачисленияФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСтавкаНДС КАК ТаблицаСтавкаНДС
		|		ПО НачисленияФизическиеЛица.Организация = ТаблицаСтавкаНДС.Организация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоТарифныхЗон КАК КоличествоТарифныхЗон
		|		ПО НачисленияФизическиеЛица.ВидДифференцированности = КоличествоТарифныхЗон.ВидДифференцированности
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияФизическиеЛица.СверхНорматива,
		|	НачисленияФизическиеЛица.ТарифнаяГруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ИСТИНА,
		|	НачисленияЮридическиеЛицаРазделВ.КатегорияПотребителя,
		|	НачисленияЮридическиеЛицаРазделВ.ЦеноваяКатегория,
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 1
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 1
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.СуммаСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 1
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ДЕНЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ДЕНЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.СуммаСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ДЕНЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.СуммаСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 2
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПИК)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПОЛУПИК)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.ОбъемУслуги
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.СуммаСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.НОЧЬ)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПИК)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.СуммаСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПИК)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПОЛУПИК)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.СуммаСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА КоличествоТарифныхЗон.КоличествоТЗ = 3
		|					И НачисленияЮридическиеЛицаРазделВ.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПОЛУПИК)
		|				ТОГДА НачисленияЮридическиеЛицаРазделВ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	""ЮЛ""
		|ИЗ
		|	НачисленияЮридическиеЛицаРазделВ КАК НачисленияЮридическиеЛицаРазделВ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоТарифныхЗон КАК КоличествоТарифныхЗон
		|		ПО НачисленияЮридическиеЛицаРазделВ.ВидДифференцированности = КоличествоТарифныхЗон.ВидДифференцированности
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияЮридическиеЛицаРазделВ.ЦеноваяКатегория,
		|	НачисленияЮридическиеЛицаРазделВ.КатегорияПотребителя"; 	
	
	Запрос.УстановитьПараметр("НачалоОП", ПараметрыОтборов.НачалоОП);
	Запрос.УстановитьПараметр("КонецОП", ПараметрыОтборов.КонецОП);  	
	Запрос.УстановитьПараметр("Организация", ПараметрыОтборов.Организация);
	Запрос.УстановитьПараметр("Район", ПараметрыОтборов.Район);
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	Возврат РезультатЗапросаПакет;
	
КонецФункции

#Область Раздел_1А

Функция СфомироватьТаблицуРаздела1А(НастройкиРазделов, РезультатЗапроса)
	
	Результат = Новый Массив;
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ДополнительныйНомерКолонки = Новый Соответствие;
	ДополнительныйНомерКолонки.Вставить(Перечисления.энргУровниНапряжения.ВН, 0);
	ДополнительныйНомерКолонки.Вставить(Перечисления.энргУровниНапряжения.СН1, 1);
	ДополнительныйНомерКолонки.Вставить(Перечисления.энргУровниНапряжения.СН2, 2);
	ДополнительныйНомерКолонки.Вставить(Перечисления.энргУровниНапряжения.НН, 3);
		
	Соответствие = СоответствиеКолонкиФайлаИПоляВВыборкеРаздел1А();
	НачальнаяКолонка = 7;
		
	ОписаниеНовойСтроки = "НомерКолонки,НомерСтроки,Значение";
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураОбъемов = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЗаполнения = СтрокаЗаполнения(НастройкиРазделов, Выборка, "НомерСтрокиФайлаРаздел1А");
		Если СтрокаЗаполнения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДопНомер = ДополнительныйНомерКолонки[Выборка.УровеньНапряженияРасчетный];
		
		Для Каждого ТекКлючЗначение Из Соответствие Цикл
			
			Значение = Выборка[ТекКлючЗначение.Значение];
			Если Значение = 0 Тогда
				Продолжить;
			КонецЕсли; 			
			
			НомерКолонки 	= НачальнаяКолонка + ДопНомер + ТекКлючЗначение.Ключ;
			НомерСтроки 	= СтрокаЗаполнения;
			КлючСтруктурыОбъемов = СтрШаблон("Строка%1Колонка%2", НомерСтроки, НомерКолонки);
			ИндексМассива = Неопределено;
			Если СтруктураОбъемов.Свойство(КлючСтруктурыОбъемов, ИндексМассива) Тогда
				НоваяСтрока = Результат.Получить(ИндексМассива);
				НоваяСтрока.Значение = НоваяСтрока.Значение + Значение;
			Иначе
				НоваяСтрока = Новый Структура(ОписаниеНовойСтроки, НомерКолонки, НомерСтроки, Значение);
				Результат.Добавить(НоваяСтрока);
				СтруктураОбъемов.Вставить(КлючСтруктурыОбъемов, Результат.ВГраница());
			КонецЕсли;	
		
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеКолонкиФайлаИПоляВВыборкеРаздел1А()
	
	Результат = Новый Соответствие;	
	Результат.Вставить(0, "ОбъемЭл1Ц");
	Результат.Вставить(7, "СтоимостьЭл1Ц");
	Результат.Вставить(14, "ОбъемЭл2Ц");
	Результат.Вставить(21, "СтоимостьЭл2Ц");
	Результат.Вставить(28, "ОбъемЭл35Ц");
	Результат.Вставить(35, "СтоимостьЭл35Ц");
	Результат.Вставить(42, "ОбъемМощ35Ц");
	Результат.Вставить(49, "СтоимостьМощ35Ц");
	Результат.Вставить(56, "ОбъемЭл46Ц");
	Результат.Вставить(63, "СтоимостьЭл46Ц");
	Результат.Вставить(70, "ОбъемМощНаРР46Ц");
	Результат.Вставить(77, "СтоимостьМощНаРР46Ц");
	Результат.Вставить(84, "ОбъемМощНаПередачу46Ц");
	Результат.Вставить(91, "СтоимостьМощНаПередачу46Ц");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Раздел_1Б

Функция СфомироватьТаблицуРаздела1Б(НастройкиРазделов, РезультатЗапроса)
	
	Результат = Новый Массив;
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Соответствие = СоответствиеКолонкиФайлаИПоляВВыборке();
	НачальнаяКолонка = 6;
	КоличествоКолонок = 11;
	
	ОписаниеНовойСтроки = "НомерКолонки,НомерСтроки,Значение";
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЗаполнения = СтрокаЗаполнения(НастройкиРазделов, Выборка, "НомерСтрокиФайлаРаздел1Б");
		Если СтрокаЗаполнения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Итерация = 0 По КоличествоКолонок Цикл	
			
			Значение = Выборка[Соответствие[Итерация]];
			Если Значение = 0 Тогда				
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Новый Структура(ОписаниеНовойСтроки);
			НоваяСтрока.НомерКолонки 	= Итерация + НачальнаяКолонка;
			НоваяСтрока.НомерСтроки 	= СтрокаЗаполнения;
			НоваяСтрока.Значение 		= Значение;
			Результат.Добавить(НоваяСтрока); 			
			
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеКолонкиФайлаИПоляВВыборке()
	
	Результат = Новый Соответствие;
	Результат.Вставить(0, "ОбъемЭл1Ц");
	Результат.Вставить(1, "СтоимостьЭл1Ц");
	Результат.Вставить(2, "ОбъемЭл2Ц");
	Результат.Вставить(3, "СтоимостьЭл2Ц");
	Результат.Вставить(4, "ОбъемЭл34Ц");
	Результат.Вставить(5, "СтоимостьЭл34Ц");
	Результат.Вставить(6, "ОбъемМощ34Ц");
	Результат.Вставить(7, "СтоимостьМощ34Ц");
	Результат.Вставить(8, "ОбъемЭл56Ц");
	Результат.Вставить(9, "СтоимостьЭл56Ц");
	Результат.Вставить(10, "ОбъемМощ56Ц");
	Результат.Вставить(11, "СтоимостьМощ56Ц");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Раздел_1В

Функция СфомироватьТаблицуРаздела1В(НастройкиРазделов, РезультатЗапроса)
	
	Результат = Новый Массив;
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Соответствие = СоответствиеКолонкиФайлаИПоляВВыборкеРаздел1В();
	НачальнаяКолонка = 9;
	КоличествоКолонок = 17;
	
	ОписаниеНовойСтроки = "НомерКолонки,НомерСтроки,Значение";
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЗаполнения = СтрокаЗаполненияРаздел1В(НастройкиРазделов, Выборка);
		Если СтрокаЗаполнения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Итерация = 0 По КоличествоКолонок Цикл	
			
			Значение = Выборка[Соответствие[Итерация]];
			Если Значение = 0 Тогда				
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Новый Структура(ОписаниеНовойСтроки);
			НоваяСтрока.НомерКолонки 	= Итерация + НачальнаяКолонка;
			НоваяСтрока.НомерСтроки 	= СтрокаЗаполнения;
			НоваяСтрока.Значение 		= Значение;
			Результат.Добавить(НоваяСтрока); 			
			
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеКолонкиФайлаИПоляВВыборкеРаздел1В()
	
	Результат = Новый Соответствие;
	Результат.Вставить(0, "ОбъемОднотарифный");
	Результат.Вставить(1, "СуммаОднотарифный");
	Результат.Вставить(2, "СуммаБезНДСОднотарифный");
	Результат.Вставить(3, "ОбъемДвухтарифныйНочь");
	Результат.Вставить(4, "ОбъемДвухтарифныйДень");
	Результат.Вставить(5, "СуммаДвухтарифныйНочь");
	Результат.Вставить(6, "СуммаДвухтарифныйДень");
	Результат.Вставить(7, "СуммаБезНДСДвухтарифныйНочь");
	Результат.Вставить(8, "СуммаБезНДСДвухтарифныйДень");
	Результат.Вставить(9, "ОбъемТрехтарифныйНочь");
	Результат.Вставить(10, "ОбъемТрехтарифныйПик");
	Результат.Вставить(11, "ОбъемТрехтарифныйПолуПик");
	Результат.Вставить(12, "СуммаТрехтарифныйНочь");
	Результат.Вставить(13, "СуммаТрехтарифныйПик");
	Результат.Вставить(14, "СуммаТрехтарифныйПолуПик");
	Результат.Вставить(15, "СуммаБезНДСТрехтарифныйНочь");
	Результат.Вставить(16, "СуммаБезНДСТрехтарифныйПик");
	Результат.Вставить(17, "СуммаБезНДСТрехтарифныйПолуПик");
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаЗаполненияРаздел1В(НастройкиРазделов, Выборка)
	
	СтрокаЗаполнения = Неопределено;
	Если Выборка.ВидЛица = "ЮЛ" Тогда
		Отбор = Новый Структура("КатегорияПотребителя, ЦеноваяКатегория", Выборка.КатегорияПотребителя, Выборка.ЦеноваяКатегория);
	Иначе
		Отбор = Новый Структура("ТарифнаяКатегория", Выборка.ТарифнаяКатегория);
	КонецЕсли;
	НайденныеНастройки = НастройкиРазделов[Выборка.ВидЛица].НайтиСтроки(Отбор);
	Если Не НайденныеНастройки.Количество() = 0 Тогда
		Если Выборка.СверхНорматива Тогда 
			СтрокаЗаполнения = НайденныеНастройки[0].НомерСтрокиСверхСоцНорматива;
		Иначе 
			СтрокаЗаполнения = НайденныеНастройки[0].НомерСтрокиВПределахСоцНорматива;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаЗаполнения;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

Функция СтрокаЗаполнения(НастройкиРазделов, Выборка, ИмяРаздела)
	
	СтрокаЗаполнения = Неопределено;
	Для Каждого СтрокаНастроек Из НастройкиРазделов Цикл 
		
		Если НастройкаКорректная(Выборка, СтрокаНастроек) Тогда 
			СтрокаЗаполнения = СтрокаНастроек[ИмяРаздела];
			Прервать;
		КонецЕсли;			
		
	КонецЦикла;
	
	Возврат СтрокаЗаполнения;
	
КонецФункции

Функция НастройкаКорректная(Выборка, СтрокаНастроек)
	
	Результат = Выборка.КатегорияПотребителя = СтрокаНастроек.КатегорияПотребителя И
		Выборка.МаксимальнаяМощность >= СтрокаНастроек.МаксимальнаяМощностьОт И Выборка.МаксимальнаяМощность < СтрокаНастроек.МаксимальнаяМощностьДо;	
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиРазделов()
	
	СхемаЗапроса = Неопределено;
	ПустаяСтруктура = Новый Структура;
	Справочники.бестКатегорииКонтрагентов.АктуальныеНастройкиЗаполненияФормы46(СхемаЗапроса, ПустаяСтруктура);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПустаяСтруктура);	
	Результат = РезультатЗапроса.Выгрузить();
	
	Возврат Результат;	
	
КонецФункции

Функция НастройкиРаздела1В()
	
	Настройки = Новый Структура;
	
	СхемаЗапроса = Неопределено;
	ПустаяСтруктура = Новый Структура;
	РегистрыСведений.бестФорма46НастройкаСвязиСТарифамиНаселения.АктуальныеДанные(СхемаЗапроса, ПустаяСтруктура);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПустаяСтруктура);	
	Результат = РезультатЗапроса.Выгрузить();
	Настройки.Вставить("ФЛ", Результат);
	
	СхемаЗапроса = Неопределено;
	ПустаяСтруктура = Новый Структура;
	Справочники.бестКатегорииКонтрагентов.АктуальныеНастройкиЗаполненияФормы46(СхемаЗапроса, ПустаяСтруктура, , Истина);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПустаяСтруктура);	
	Результат = РезультатЗапроса.Выгрузить();
	Настройки.Вставить("ЮЛ", Результат);
	
	Возврат Настройки;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
